RhinoInside.Revit API Documentation
GeometryEncoder.ToPoint Method
 Converts the specified Rhino.Geometry.Point to an equivalent of Autodesk.Revit.DB.Point.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8026
Syntax
public static Autodesk.Revit.DB.Point ToPoint(
	this Rhino.Geometry.Point point
)
@staticmethod
def ToPoint(
	point: Rhino.Geometry.Point
) -> Autodesk.Revit.DB.Point
Parameters
point
Type: Rhino.Geometry.Point
Rhino point to convert.
Return Value
Type: Autodesk.Revit.DB.Point
Revit Point that is equivalent to the provided Rhino point.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Rhino.Geometry.Point. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Examples
 Using ToPoint(Point) as extension method:
1using DB = Autodesk.Revit.DB;
2using RhinoInside.Revit.Convert.Geometry;
3
4DB.Point revitPoint = rhinoPoint.ToPoint();
1import clr
2clr.AddReference("RevitAPI")
3clr.AddReference("RhinoInside.Revit")
4import Autodesk.Revit.DB as DB
5import RhinoInside.Revit.Convert.Geometry
6clr.ImportExtensions(RhinoInside.Revit.Convert.Geometry)
7
8revit_point: DB.Point = rhino_point.ToPoint()
 Using ToPoint(Point) as static method:
1using DB = Autodesk.Revit.DB;
2using RhinoInside.Revit.Convert.Geometry;
3
4DB.Point revitPoint = GeometryEncoder.ToPoint(rhinoPoint);
1import clr
2clr.AddReference("RevitAPI")
3clr.AddReference("RhinoInside.Revit")
4import Autodesk.Revit.DB as DB
5import RhinoInside.Revit.Convert.Geometry.GeometryEncoder as ge
6
7revit_point: DB.Point = ge.ToPoint(rhino_point)
See Also
Reference
GeometryEncoder Class
RhinoInside.Revit.Convert.Geometry Namespace